[
    {
        "date": "1 June 2024",
        "title": "7",
        "md_content": "Why are there 7 days in a week? Funny enough, this question has come up in conversation twice independently in the last week, so I was curious. Many common units of time seem to make sense intrinsically due to their ties with astronomy and nature. The \"day\" is based on the time it takes for earth to complete one rotation and the \"year\" is based on the time it takes for the earth to orbit the sun. Of course, there are many other units of time which do not appear to be based on any particular natural phenomenon. For example, why do we divide a day into specifically 24 intervals, or to divide those intervals into 60 smaller intervals? As an aside, it turns out the ratio 1 day : 24 hours is actually due to observations in nature. It is thought that Ancient Egyptions divided the day into two 12 hour halfs because during the night-time half, there were 12 patterns in the stars that could be identified chronologically. However, the ratio 1 hour : 60 minutes is likely unrelated to nature and more likely due to the Ancient Babylonians' tendency to count in base 60. \n\n Regardless of their origins, these units of time are still closely related to nature because they even divide one day, which is an important property for their definition and utility. However, the concept of the week does not fit this model. It is neither tied to any celestial event, nor used to compose a greater concept that is related to a natural phenomenon. It does not evenly divide one unit of any \"natural\" measure of time, so where does it come from? It turns out, it is simply that 7 was considered a special number by a variety of ancient religions and cultures. They just liked the number 7 a lot 3,500+ years ago, and as a result we still, to this day, organize our entire lives around the number, whether it be weekly meetings, weekly meal preps, weekly days off, etc."
    },
    {   "date": "7 September 2024",
        "title": "Provenance",
        "md_content": "One side effect of the accelerating growth of generative AI over the last two years has been that it’s becoming harder to trust digital media. Whether it be pics on your Instagram feed or spam calls about car insurance, discerning the authenticity of these once hard-to-forge content is getting harder, mostly because generative models have become very good at fabricating them. \n\n\nIt’s true, Photoshop has existed for many years, and still longer before that there were counterfeit mechanisms like faking handwritten signatures. But, generative AI has advanced the tools of forgery in new ways that leave almost no form of media safe. Even the most generally trusted digital signals, like the voice of a loved-one over the phone, are becoming increasingly prone to undetectable forgery. In other words, in the not-so-distant future, it will become impossible to believe anything on the internet is authentic.\n\n\nBroadly, there are two ways to address this problem. The first is to become better at identifying forged content as forged (identifying true negatives). The second is to become better at identifying authentic content as authentic (identifying true positives). Currently, the first option (identifying true negatives), is not very reliable. According to [this blog post](https://ai.meta.com/blog/stable-signature-watermarking-generative-ai/) by Meta AI, the *most* effective existing detection methods today can identify 50% of AI generated images and has an error rate (false negatives) of 1/100.\n\n\nSo what about the other option? I was surprised to learn that a lot of big companies have been investing in this area. It’s called “Media Provenance”, and, as the C2PA [(Coalition for Content Provenance and Authenticity)](https://c2pa.org/) says, it “refers to the basic, trustworthy facts about the origins of a piece of digital content (image, video, audio recording, document).” In other words, Media Provenance is a way to prove that a piece of media was created by a trusted entity and has not been tampered with.\n\n\nHow can this be achieved? It turns out, through the same mechanisms that have powered TLS and the Internet for the past 20+ years — cryptography and Certificate Authorities. The C2PA, as well as a bunch of other organizations and companies (including Microsoft, Adobe, OpenAI, etc), have proposed a protocol specification for this solution, and implemented it, called “Content Credentials”. \n\n\nContent Credentials are basically metadata attached to media which include information about the identity of the content creator, time it was created, and other details which are important to know when evaluating the authenticity of a piece of content. This metadata, along with the content itself, is signed cryptographically with a secret key and then bundled together. Altogether, this forms a “C2PA Manifest”, which is the fancy name for the concept of a Content Credential. End users can consume this manifest by checking that the signature matches the content and its metadata. If any of the data was tampered, the signature will not match.\n\n\nThe big question is, who maintains the secret keys and signs manifests? The answer, generally, is a CA (Certificate Authority). Not the same CAs we rely on to provide certificates to trusted domain admins, a new type of CA which provides certificates to trusted content producers. The end user can then adjust their level of trust concerning content on the internet to that of the CA which provided the certificate. The true positive rate on identifying authentic content becomes whatever percentage of consumed media offers a Content Credential, and the false positive rate is 0%.\n\n\nTo summarize, there is a relatively new protocol for verifying content provenance and authenticity, and it is beginning to see adoption. Going forward, it could be the only way to trust the authenticity of content on the internet, and that is a scary thought. ds\n"
    }
]